package chap10_03;

public class Item {
	String name;
	int price;
	public Item(String name) {
		this.name = name;
		this.price = 0;
	}
	public Item(String name, int price) {
		super();
		this.name = name;
		this.price = price;
	}







}
//コンストラクタ
//インスタンス化したときに自動的に処理される初期化のやつ
//super();が隠れている
//親コンストラクタが一番最初に行われる
//super();はコンストラクタの一番最初にしか書けない　しかし省略してもかまわない
//
//デフォルトコンストラクタ　コンストラクタが書かれてないときに自動的に処理されるコンストラクタ
//superのエラーを解消するには、Itemクラスに引数のないコンストラクタを作るか、super();に引数を持たせるか
//コンストラクタのところは複雑なのでよく整理しておく
//is a の関係　子クラスは親クラスの一種である
//is aの関係じゃないやつを継承してはいけない２つの理由　
//クラスを拡張していった時に、現実世界と矛盾が生じてオブジェクト指向から離れて矛盾が生じてくるから
//オブジェクト指向の多態性を利用できなくなるから
//p398
//汎か特化
//親クラスになればなるほど抽象的なものになる　一般的　あいまい　生物
//子クラスであるばあるほど具体的なものになる　特殊　おれ
//継承　ある２つのクラスに特化汎化の関係があることを示すための道具
//
//
//-------------------------練習問題１０－①-----------------------------
//２３５　is a
//-------------------------練習問題１０－②-----------------------------
//ア家電
//イiphon
//ウ乗り物
//エハンドル→トラック　種類を答える
//オbook
//カpage→英和辞書とか動物辞書とかそんなやつ
//-------------------------練習問題１０－③-----------------------------
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//

