package rensyu;

public class Rensyu_1 {
public static void main(String[] args) {
	String name = "山田";
	int points = 300;
	System.out.println("ようこそ" + name+ "様。 現在のポイントは" + points + "です。" );
}

}
//100点＋１００点
//最低４０点以上　評価基準でそれぞれ４割り以上とること
//楽して楽しく良いものを作れる
//オブジェクト指向　考え方　部品化
//原始時代　数える時　１以上　自然数
//わずか１４００年前　人間が考え方とらえ加tっを変えただけなんだよ
//概念　空気を読むってどういうこと？みたいなことかな？
//ITのみならず社会生活を発展させる基盤となっている
//人が楽をｓるうためにプログラミングを学ぶ
//江戸時代　手作業　機械に肩代わりさせている
//自動販売機
//日記帳がブログ
//人間に変わってやるだけ。現実の人間の活動と無関係になるものはない
//現実で行われていることと照らし合わせる
//現実で「使われているものが大切
//現実世界に出てくる当時追う人物の単位で
//もの＝オブジェクト指向
//通帳といういクラスを作ろう
//受付というクラスを作ろう
//両替というクラスを作ろう
//
//
//
