package calcapp.main;
//パッケージのimport→コード内で指定する長さを短くするだけのもん
import calcapp.logics.CalcLogic;

public class Calc {

	public static void main(String[] args) {
		// TODO 自動生成されたメソッド・スタブ
		int a = 10;
		int b = 2;
		int total = CalcLogic.tasu(a,b);
		int delta = CalcLogic.hiku(a,b);
		System.out.println("足すと" + total +  "、引くと" + delta);


	}


}
//カレントディレクトリpwd
//拡張for文は配列ノ時だけ
//for(int value:scores){
//System.out.print(value);
//}これでscoresの中を全部を取り出す処理

//ファイル右クリックその他でタブ消せる
//
//WEBサイトを一から制作する場合、

//・要件定義とサイト設計
//
//・フレームワーク・デザインの決定
//
//・コーディング・システム開発
//
//・サーバーとドメインの準備
//
//・公開
//
//・GA/SCなどSEO対策
//
//・数値解析準備
//
//・運用保守
//
//逆に開発会社が経験したことない分野の開発を依頼してしまうと、
//調べながら開発することになるので、トラブルの元になりかねません。
//
//
//ウェブサイトの制作の目的（売上アップか会社のブランディングなのか）

//ターゲット層（性別・年齢・職業・趣味など実際のお客様のデータをもらう）
//
//サイトに必要な情報（会社概要・お問い合わせフォーム・サービス紹介以外に何があるか）
//
//素材の確認（ロゴデータ・写真データ・会社パンフレット等あるか）
//
//別料金がかかることを説明（写真撮影・キャラクター作成・イラスト作成）
//
//サーバー情報（ログインIDとパスワード等の情報）
//
//納品希望日（基本的には6週間以上を確保する）
//
//環境変数で検索場所を登録しておくことができる
//人月→ひと月かかるプロジェクトに何人必要なのか？という単位
//パッケージは小文字から、クラスは大文字から始まる
//だから、長いコードで先頭が大文字であればわかりやすい
//FQCN完全限定クラス名
//
//
//
